In [1]:
# Imports
import pandas as pd

### Análisis de la tabla Clientes

In [2]:
df_clientes = pd.read_excel(r"Base de datos/clientes.xlsx")
df_clientes.head()

,id_cliente,nombre_cliente,email,ciudad,fecha_alta
0,1,Mariana Lopez,mariana.lopez@mail.com,Carlos Paz,2023-01-01
1,2,Nicolas Rojas,nicolas.rojas@mail.com,Carlos Paz,2023-01-02
2,3,Hernan Martinez,hernan.martinez@mail.com,Rio Cuarto,2023-01-03
3,4,Uma Martinez,uma.martinez@mail.com,Carlos Paz,2023-01-04
4,5,Agustina Flores,agustina.flores@mail.com,Cordoba,2023-01-05

In [ ]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_cliente      100 non-null    int64
 1   nombre_cliente  100 non-null    object
 2   email           100 non-null    object
 3   ciudad          100 non-null    object
 4   fecha_alta      100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 4.0+ KB

In [7]:
df_clientes.describe(include='all')

,id_cliente,nombre_cliente,email,ciudad,fecha_alta
count,100.000000,100,100,100,100
unique,NaN,95,100,6,NaN
top,NaN,Bruno Castro,mariana.lopez@mail.com,Rio Cuarto,NaN
freq,NaN,2,1,23,NaN
mean,50.500000,NaN,NaN,NaN,2023-02-19 12:00:00
min,1.000000,NaN,NaN,NaN,2023-01-01 00:00:00
25%,25.750000,NaN,NaN,NaN,2023-01-25 18:00:00
50%,50.500000,NaN,NaN,NaN,2023-02-19 12:00:00
75%,75.250000,NaN,NaN,NaN,2023-03-16 06:00:00
max,100.000000,NaN,NaN,NaN,2023-04-10 00:00:00
std,29.011492,NaN,NaN,NaN,NaN

In [8]:
df_clientes.duplicated().sum()

np.int64(0)

In [9]:
df_clientes.isnull().sum()

id_cliente        0
nombre_cliente    0
email             0
ciudad            0
fecha_alta        0
dtype: int64

In [26]:
df_clientes[df_clientes['nombre_cliente']=='Agustina Martinez']

,id_cliente,nombre_cliente,email,ciudad,fecha_alta
45,46,Agustina Martinez,agustina.martinez@mail.com,Alta Gracia,2023-02-15
84,85,Agustina Martinez,agustina.martinez2@mail.com,Mendiolaza,2023-03-26

In [18]:
df_clientes.nombre_cliente.value_counts()

nombre_cliente
Bruno Castro         2
Karina Acosta        2
Elena Rodriguez      2
Olivia Perez         2
Agustina Martinez    2
                    ..
Rocio Gonzalez       1
Uma Alvarez          1
Camila Castro        1
Bruno Molina         1
Agustina Lopez       1
Name: count, Length: 95, dtype: int64

La tabla Clientes presenta datos integros. No se requiere limpieza.

### Análisis de la tabla Ventas

In [31]:
df_ventas = pd.read_excel(r"Base de datos/Ventas.xlsx")
df_ventas.head()

,id_venta,fecha,id_cliente,nombre_cliente,email,medio_pago
0,1,2024-06-19,62,Guadalupe Romero,guadalupe.romero@mail.com,tarjeta
1,2,2024-03-17,49,Olivia Gomez,olivia.gomez@mail.com,qr
2,3,2024-01-13,20,Tomas Acosta,tomas.acosta@mail.com,tarjeta
3,4,2024-02-27,36,Martina Molina,martina.molina@mail.com,transferencia
4,5,2024-06-11,56,Bruno Diaz,bruno.diaz@mail.com,tarjeta

In [32]:
df_ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_venta        120 non-null    int64
 1   fecha           120 non-null    datetime64[ns]
 2   id_cliente      120 non-null    int64
 3   nombre_cliente  120 non-null    object
 4   email           120 non-null    object
 5   medio_pago      120 non-null    object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 5.8+ KB

In [33]:
df_ventas.describe(include='all')

,id_venta,fecha,id_cliente,nombre_cliente,email,medio_pago
count,120.000000,120,120.000000,120,120,120
unique,NaN,NaN,NaN,64,67,4
top,NaN,NaN,NaN,Bruno Diaz,bruno.diaz@mail.com,efectivo
freq,NaN,NaN,NaN,5,5,37
mean,60.500000,2024-03-29 17:36:00,47.291667,NaN,NaN,NaN
min,1.000000,2024-01-02 00:00:00,1.000000,NaN,NaN,NaN
25%,30.750000,2024-02-11 06:00:00,24.500000,NaN,NaN,NaN
50%,60.500000,2024-03-25 00:00:00,48.500000,NaN,NaN,NaN
75%,90.250000,2024-05-19 06:00:00,67.500000,NaN,NaN,NaN
max,120.000000,2024-06-28 00:00:00,100.000000,NaN,NaN,NaN
std,34.785054,NaN,27.854181,NaN,NaN,NaN

In [ ]:
df_ventas.medio_pago.value_counts(dropna=False)

medio_pago
efectivo         37
qr               30
transferencia    27
tarjeta          26
Name: count, dtype: int64

In [37]:
df_ventas.id_cliente.nunique()

67

La tabla de Ventas presenta datos integros. No se requiere limpieza.

Nota: Existen clientes en la tabla Clientes que no tienen ventas (67/100).

### Análisis de la tabla Productos

In [40]:
df_productos = pd.read_excel(r"Base de datos/Productos.xlsx")
df_productos.head()

   id_producto     nombre_producto  categoria  precio_unitario
0            1      Coca Cola 1.5L  Alimentos             2347
1            2          Pepsi 1.5L   Limpieza             4973
2            3         Sprite 1.5L  Alimentos             4964
3            4  Fanta Naranja 1.5L   Limpieza             2033
4            5  Agua Mineral 500ml  Alimentos             4777

In [42]:
df_productos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_producto      100 non-null    int64
 1   nombre_producto  100 non-null    object
 2   categoria        100 non-null    object
 3   precio_unitario  100 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.2+ KB

In [48]:
df_productos.describe(include='all').round(2)

        id_producto nombre_producto  categoria  precio_unitario
count        100.00             100        100           100.00
unique          NaN             100          2              NaN
top             NaN  Coca Cola 1.5L  Alimentos              NaN
freq            NaN               1         50              NaN
mean          50.50             NaN        NaN          2718.55
std           29.01             NaN        NaN          1381.64
min            1.00             NaN        NaN           272.00
25%           25.75             NaN        NaN          1590.00
50%           50.50             NaN        NaN          2516.00
75%           75.25             NaN        NaN          4026.50
max          100.00             NaN        NaN          4982.00

In [54]:
df_productos.duplicated().sum()

np.int64(0)

In [55]:
df_productos.isnull().sum()

id_producto        0
nombre_producto    0
categoria          0
precio_unitario    0
dtype: int64

In [45]:
df_productos.categoria.value_counts()

categoria
Alimentos    50
Limpieza     50
Name: count, dtype: int64

In [46]:
df_productos.nombre_producto.value_counts()

nombre_producto
Coca Cola 1.5L         1
Pepsi 1.5L             1
Sprite 1.5L            1
Fanta Naranja 1.5L     1
Agua Mineral 500ml     1
                      ..
Suavizante 1L          1
Limpiavidrios 500ml    1
Desengrasante 500ml    1
Esponjas x3            1
Trapo de Piso          1
Name: count, Length: 100, dtype: int64

La tabla de Ventas presenta datos integros. No se requiere limpieza.

### Análisis de la tabla Ventas

In [3]:
df_detalle_ventas = pd.read_excel(r"Base de datos/Detalle_ventas.xlsx")
df_detalle_ventas.head()

,id_venta,id_producto,nombre_producto,cantidad,precio_unitario,importe
0,1,90,Toallas Húmedas x50,1,2902,2902
1,2,82,Aceitunas Negras 200g,5,2394,11970
2,2,39,Helado Vainilla 1L,5,469,2345
3,2,70,Fernet 750ml,2,4061,8122
4,2,22,Medialunas de Manteca,1,2069,2069

In [4]:
df_detalle_ventas.describe(include='all').round(2)

,id_venta,id_producto,nombre_producto,cantidad,precio_unitario,importe
count,343.00,343.00,343,343.00,343.00,343.00
unique,NaN,NaN,95,NaN,NaN,NaN
top,NaN,NaN,Queso Rallado 150g,NaN,NaN,NaN
freq,NaN,NaN,9,NaN,NaN,NaN
mean,61.49,49.14,NaN,2.96,2654.50,7730.08
std,34.84,29.14,NaN,1.37,1308.69,5265.54
min,1.00,1.00,NaN,1.00,272.00,272.00
25%,31.00,23.00,NaN,2.00,1618.50,3489.00
50%,61.00,47.00,NaN,3.00,2512.00,6702.00
75%,93.00,76.00,NaN,4.00,3876.00,10231.50
max,120.00,100.00,NaN,5.00,4982.00,24865.00

In [51]:
df_detalle_ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343 entries, 0 to 342
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_venta         343 non-null    int64
 1   id_producto      343 non-null    int64
 2   nombre_producto  343 non-null    object
 3   cantidad         343 non-null    int64
 4   precio_unitario  343 non-null    int64
 5   importe          343 non-null    int64
dtypes: int64(5), object(1)
memory usage: 16.2+ KB

In [52]:
df_detalle_ventas.isnull().sum()

id_venta           0
id_producto        0
nombre_producto    0
cantidad           0
precio_unitario    0
importe            0
dtype: int64

In [53]:
df_detalle_ventas.duplicated().sum()

np.int64(0)

In [56]:
df_detalle_ventas.nombre_producto.value_counts()

nombre_producto
Queso Rallado 150g          9
Lavandina 1L                7
Ron 700ml                   7
Desodorante Aerosol         7
Salsa de Tomate 500g        7
                           ..
Sprite 1.5L                 1
Alfajor Triple              1
Maní Salado 200g            1
Vinagre de Alcohol 500ml    1
Vino Tinto Malbec 750ml     1
Name: count, Length: 95, dtype: int64